{"he":"<p style=\"text-align:justify;\">&nbsp;</p><p style=\"text-align:justify;\">&nbsp;</p><p style=\"text-align:justify;\">Kiedyś przyjaciel powiedział mi&nbsp;</p><blockquote><p style=\"text-align:justify;\">zawsze biorę się za projekty, które wymagają ode mnie 120%. 100% mogę dać z siebie zawsze, 20% się nauczę lub ktoś mi pomoże.</p></blockquote><p style=\"text-align:justify;\">Patrząc na wiedzę z jaką zaczynałem pisać bloga, ten pomysł wymagał ode mnie 180%. Mimo wielu przeciwności od strony technicznej to wcale nie pisanie kodu było największym wyzwanie… To co zajęło mi najwięcej czasu to…</p><p style=\"text-align:justify;\"><strong>Napisanie tekstów w </strong><a href=\"https://zmaczowani.pl/pawel\"><strong>https://zmaczowani.pl/pawel</strong></a> .&nbsp;</p><p style=\"text-align:justify;\">Nie należę do osób wylewnych. Raczej wolę słuchać co ciekawego mają do powiedzenia inni. Jednak gdy ktoś mnie o coś zapyta to nie mam problemu opowiedzieć o sobie, potrzebuję tylko dobrze sprecyzowane pytanie. Dlatego też ostatnio na lekcji języka angielskiego:</p><ul><li><p style=\"text-align:justify;\">Hello Paweł, how are you?</p></li><li><p style=\"text-align:justify;\">Ah, it's the worst question, i don't know what to say…</p></li><li><p style=\"text-align:justify;\">I think the worst is “tell me something about you”</p></li><li><p style=\"text-align:justify;\">Ooo! Please don't ask me about it!</p></li></ul><p style=\"text-align:justify;\">Całe szczęście wtedy już miałem “powiedziane coś&nbsp;o sobie”. Wtedy zdałem sobie sprawę, że właśnie ta część najdłużej się ciągnęła. Regularnie kilka razy w tygodniu podczas spaceru na siłownie i z powrotem ciągle zaczynałem ten sam temat, “co napisać”, “co kogoś może zainteresować”, “jak to ubrać w słowa”. Pewnego razu przypomniałem sobie, że jedyny przedmiot, z którego miałem zagrożenie to programowanie. Teraz jestem programistą. Jeżeli chodzi o język polski to też nie było kolorowo, a napisałem i prowadzę bloga. Ile razy słyszałem “Grzenkowicz nigdy nie będziesz programistą”, “Grzenkowicz, polonistą to ty nie zostaniesz”. Szach mat. Sukces to coś co innych boli najbardziej. Oczywiście dawałem tym nauczycielkom wiele powodów aby tak myślały - rozprawka na 200 słów, “proszę pani, czy ‘a’ i ‘o’ to się liczy jako słowo”? Jak wspominałem. Nigdy nie byłem wylewny. Blog jest połączniem dwóch najgorzej wspominianych przedmiotów szkolnych.&nbsp;</p><p>&nbsp;</p><p style=\"text-align:justify;\">Teraz czas na stronę techniczną. Jestem programistą od 7 lat. Przez cały czas zajmowałem się głównie backend'em. Jest to część logiczna. Pobieranie danych, modyfikacja, kalkulacje i wszystko co dzieje się z “tyłu”. Jeżeli chodzi o frontend to nigdy mnie do tego nie ciągnęło. Jest to wszystko co dzieje się z “przodu” - w skrócie wszystko co widzicie na stronie.&nbsp;</p><p style=\"text-align:justify;\">Jestem daltonistą, nie potrafię odróżnić białego od beżowego. Zresztą, mężczyzna zna tylko 3 kolory. Jako, że lubię się uczyć i chciałem zostać fullstack'iem (osoba, która ma wiedzę na backend'ie i frontend'ie) to postanowiłem nauczyć się kilku języków fronend'owych.&nbsp;</p><figure class=\"image image_resized\" style=\"width:75%;\"><img src=\"https://img.zmaczowani.pl/original/article/content/2024/poczatek-bloga.png\" srcset=\"https://img.zmaczowani.pl/small/article/content/2024/poczatek-bloga.png 320w, https://img.zmaczowani.pl/medium/article/content/2024/poczatek-bloga.png 768w, https://img.zmaczowani.pl/original/article/content/2024/poczatek-bloga.png 1024w\" sizes=\"100vw\" width=\"1024\"><figcaption>wszystko krzywo, pszycisk napisany z błędem na poprowę humoru</figcaption></figure><p>&nbsp;</p><figure class=\"image image_resized\" style=\"width:75%;\"><img src=\"https://img.zmaczowani.pl/original/article/content/2024/strona-glowna-poczatek.png\" srcset=\"https://img.zmaczowani.pl/small/article/content/2024/strona-glowna-poczatek.png 320w, https://img.zmaczowani.pl/medium/article/content/2024/strona-glowna-poczatek.png 768w, https://img.zmaczowani.pl/original/article/content/2024/strona-glowna-poczatek.png 1024w\" sizes=\"100vw\" width=\"1024\"><figcaption>Tak wyglądał początek strony. Jak sami widzicie same ostre kolory aby się nie zlewały.&nbsp;</figcaption></figure><p>&nbsp;</p><figure class=\"image image_resized\" style=\"width:50%;\"><img src=\"https://img.zmaczowani.pl/original/article/content/2024/mobilka-poczatek.png\" srcset=\"https://img.zmaczowani.pl/small/article/content/2024/mobilka-poczatek.png 320w, https://img.zmaczowani.pl/medium/article/content/2024/mobilka-poczatek.png 768w, https://img.zmaczowani.pl/original/article/content/2024/mobilka-poczatek.png 1024w\" sizes=\"100vw\" width=\"1024\"></figure><p style=\"text-align:justify;\">Już koniec upokarzania się. Każdy kiedyś zaczynał. Co do rzeczy technicznych, które napsuły mi najwięcej krwi to obrazki. Nie sądziłem, że frontend'owcy mają takie trudne zadanie. Zawsze uważałem, że dostają ode mnie dane i muszą je tylko wyświetlić, co to za problem?&nbsp;</p><p style=\"text-align:justify;\">Tak jak napisałem na samej górze “ktoś mi pomoże”. W moim przypadku był (mam nadzieję, że nadal jest po zawracaniu mu dupy codziennie) to mój dobry przyjaciel Wojtek. Nie rozumiem i nie wiem jak to możliwe ale na każde pytanie znał odpowiedź, każdy problem potrafił&nbsp;rozwiązać. Chciałem go dopisać do stopki jako współtwórca ale “nie chcę widnieć na tak byle jak napisanej stronie”. Jak chciał tak zrobiłem. Łaski bez. Jeszcze będzie się&nbsp;prosił o tę stronę do portfolio.&nbsp;</p><p style=\"text-align:justify;\">Blog powstawał dość długo. Na początku miał to być zupełnie inny projekt. Pierwsza data w kontroli wersji to 06.01.2023. Jednak start pracy nad blogiem był trochę później - 06.07.2023. Od razu zaznaczę, że nie była to praca po 8 godzin dziennie. Czasami siedziałem godzinkę, czasami 16, a czasami 2 minuty. Wielu również pomyśli, że napisanie bloga to 30 minut w WordPress'ie. I mają rację. Tylko moim celem nie było pisanie bloga tylko nauka. Blog powstawał przy okazji. Teraz cieszę się, że przed moimi 30stymi urodziny prace są skończone. Wszystko działa mniej lub bardziej i teraz będzie można dzielić się z Wami naszymi spostrzeżeniami jednoczeście poprawiając to co już jest i dodawać nowe ciekawe rzeczy.&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>A pomysłów mamy sporo ;)&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p style=\"text-align:justify;\"><span style=\"font-size:12px;\">Stack technologiczny dla zainteresowanych: PHP 8.3, Symfony 6.4, Vue 3, TypeScript, Vite, Baza mongo (póki co, zamierzam zmienić na SQL), DDD, CQRS, EDD, EventStorming, PHPUnit + coverage, Codeception, Infection.</span></p><p style=\"text-align:justify;\"><span style=\"font-size:12px;\">Do zarządzania zadaniami technicznymi wykorzystuję asanę, do współpracy z Sandrą trello (mam nadzieję, żę się przekona i pozwoli to usprawnić wspólną pracę).</span></p>","she":"<p style=\"text-align:justify;\"><span style=\"background-color:transparent;font-family:'Playfair Display',serif;\">Cała idea powstania <strong>zmaczowanych</strong> powstała z inicjatywy Pawła. Jako programista był rozentuzjazmowany na myśl o stworzeniu własnego bloga, napisaniu wszystkiego od podstaw.</span></p><figure class=\"image image_resized image-style-side\" style=\"width:300px;\"><img src=\"https://img.zmaczowani.pl/original/article/content/2024/prototyp-logo.jpg\" srcset=\"https://img.zmaczowani.pl/small/article/content/2024/prototyp-logo.jpg 320w, https://img.zmaczowani.pl/medium/article/content/2024/prototyp-logo.jpg 768w, https://img.zmaczowani.pl/original/article/content/2024/prototyp-logo.jpg 1024w\" sizes=\"100vw\" width=\"1024\"><figcaption>Początkowy projekt logo wykonany przez Pawła</figcaption></figure><p style=\"text-align:justify;\"><span style=\"background-color:transparent;font-family:'Playfair Display',serif;\">Początkowo byłam trochę sceptycznie nastawiona i muszę przyznać, że nieco nie wierzyłam w to, że może się to wszystko udać.&nbsp;</span></p><p style=\"text-align:justify;\"><span style=\"background-color:transparent;font-family:'Playfair Display',serif;\">Za każdym razem, kiedy Paweł opowiadał mi podekscytowany, jak to widzi, w głowie sobie myślałam: \"<i><strong>Próbuj, twórz, ale i tak na pewno nic z tego nie wyjdzie. Kto w dzisiejszych czasach wchodzi na blogi i czyta artykuły?</strong></i>\".&nbsp;</span></p><p style=\"text-align:justify;\"><span style=\"background-color:transparent;font-family:'Playfair Display',serif;\">Dopiero kiedy zobaczyłam, jak w to wszystko się zaangażował, ile nerwów Go to kosztuje, jak codziennie każda nasza rozmowa sprowadza się do nowych pomysłów na blogu, dotarło do mnie, że nie ma żartów i faktycznie mój mąż zaciekle dąży do tego, aby zrealizować swój cel.&nbsp;</span></p><p style=\"text-align:justify;\"><span style=\"background-color:transparent;font-family:'Playfair Display',serif;\">Uznałam, że może i faktycznie to całkiem fajny pomysł. Coś nowego, nieoczywistego, czego jeszcze wcześniej nie widziałam. Pisanie na dany temat z dwóch, innych perspektyw. Tym bardziej, że jako oddzielne jednostki jesteśmy tak całkowicie różni, mamy zupełnie inne poglądy i postrzegamy świat w całkowicie innym wymiarze.&nbsp;</span></p><p style=\"text-align:justify;\"><span style=\"background-color:transparent;font-family:'Playfair Display',serif;\">Paweł odpowiedzialny był za wszystko, czego gołym okiem na naszej stronie nie widać, ale są to turbo ważne rzeczy, bez których zmaczowani by nie istnieli. Spędził setki, a może i tysiące? godzin nad tym projektem. Nie jestem dobra w konkretnym precyzowaniu, ale w każdym razie poświęcił nad tym bardzo dużo czasu.</span></p><p style=\"text-align:justify;\"><span style=\"background-color:transparent;font-family:'Playfair Display',serif;\">Ja odpowiedzialna byłam za wygląd wizualny, rozplanowanie. Uwielbiam tworzyć takie kreatywne rzeczy, dopinać szczegóły, aby wszystko było ze sobą spójne. Od wyboru kolorów po czcionki, wymiary, odstępy.</span></p><p>&nbsp;</p><p style=\"text-align:justify;\"><span style=\"background-color:transparent;font-family:'Playfair Display',serif;\"><strong>NAJWIĘKSZYM PROBLEMEM</strong> podczas całego tworzenia bloga w skrócie myślę, że byłam to ja. I podejrzewam, że mój mąż w swojej części artykułu napisze podobnie.</span></p><p style=\"text-align:justify;\"><span style=\"background-color:transparent;font-family:'Playfair Display',serif;\">Jestem strasznie niezorganizowana i ciężko mi się spiąć w terminie. Paweł jest zadaniowcem - ma coś do zrobienia i to robi, a ja rozpraszam się wszystkim dookoła i przypomina mi się po czasie, że miałam coś zrobić.</span></p><p style=\"text-align:justify;\"><span style=\"background-color:transparent;font-family:'Playfair Display',serif;\">Zwłaszcza teraz, będąc w ciąży, po kilku minutach zapominam o tym, że chociażby chciało mi się pić, a gdzie mowa o robieniu jakiś bardziej skomplikowanych czynności.</span></p><p style=\"text-align:justify;\"><span style=\"background-color:transparent;font-family:'Playfair Display',serif;\">Paweł musiał cały czas mnie ponaglać o rzeczy, którymi miałam się zająć, czego bardzo nie lubię. Nie lubię, kiedy ktoś notorycznie mi mówi, co mam zrobić. Mimo, że miał do tego pełne prawo, gdyż nie wywiązałam się z umówionego terminu. Wiem. Paranoja. Ale bardzo wtedy się irytuję bo teoretycznie wiem, co mam zrobić. Tylko… czasem brakuje mi motywacji, chęci, weny i nie lubię robić niczego na siłę. Wolę poczekać dzień, dwa, aż naładuję baterie i dam z siebie 100%. O to chyba najczęściej się sprzeczaliśmy w trakcie tworzenia strony. Przez to, że ja na czas nie podsyłałam Pawłowi rzeczy, których potrzebował, blokowałam też Jego pracę i wszystko stało w miejscu, opóźniając się.</span></p><p style=\"text-align:justify;\"><span style=\"background-color:transparent;font-family:'Playfair Display',serif;\">Dodatkowo jestem strasznie wybredna i w aspektach wizualnych zbyt perfekcyjna. Potrafię poprawiać coś 150 razy, bo raz jest o 1mm za bardzo w prawo, a drugim razem za bardzo w lewo i razi mnie to w oczy.&nbsp;</span></p><p style=\"text-align:justify;\"><span style=\"background-color:transparent;font-family:'Playfair Display',serif;\">Na szczęście Paweł ma anielską cierpliwość i to chyba był&nbsp;<i><strong>klucz do sukcesu</strong></i> powstania naszej strony.&nbsp;</span></p><p style=\"text-align:justify;\"><span style=\"background-color:transparent;font-family:'Playfair Display',serif;\">&nbsp;</span></p>"}
